Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G40A.tmx
Source language: en_us
Languages: zh_cn

source: Remembering Ravi Shankar the godfather of world music
zh_cn: 拉维·香卡:世界音乐之父

source: AT A music festival in California in June 1967, a middle-aged sitar player watched Jimi Hendrix set his guitar on fire.
zh_cn: 1967年6月，在加州举行的一场音乐节上，一位中年西塔琴演奏者看着吉米·汉德克斯点燃了他的吉他。

source: The crowd cheered. Ravi Shankar was horrified.
zh_cn: 人群欢声雷动，他却满脸惊恐。他就是拉维·香卡。

source: Mr Shankar, who died in San Diego on December 11, aged 92, was an Indian classical musician who brought the sounds of the sitar and the raga into Western pop music.
zh_cn: 香卡先生于今年12月11日在圣地亚哥去世，享年92岁。他是印度古典音乐的大师，将西塔琴和拉格的曲调带到了西方流行音乐中。

source: From the 1960s onwards, by collaborating with and influencing musicians such as John Coltrane and George Harrison (pictured with Mr Shankar above), he engendered the kinds of fusions that have since become more common.
zh_cn: 从1960年开始，他与约翰·克特兰、乔治·哈里森等音乐家合作并对他们有着巨大影响。（上图为与哈里森合影）他开创了印度音乐与西方流行乐的融合，现在这种融合已非常普遍。

source: Harrison once called him "the godfather of world music".
zh_cn: 哈里森曾称他为“世界音乐的教父”。

source: Born in 1920 in Benares, a holy Indian city now called Varanasi, Mr Shankar came from an affluent and artistic family.
zh_cn: 他于1920年生于巴勒斯，这座现名为瓦拉纳西的城市是印度教的圣地。香卡一家家境宽裕，充满艺术气息。

source: The Shankars were Brahmins, members of India's highest caste, and Bengalis, who hail from an area of eastern India that is rich with poets, philosophers and film-makers.
zh_cn: 他们属于印度最高的种姓—— 婆罗门，同时他们也是孟加拉人，来自印度东部一块盛产诗人、哲学家和导演的土地。

source: Their eldest son was a dancer who worked with Anna Pavlova, the world's top ballerina in the early-20th century.
zh_cn: 香卡家的长子曾与20世界早期最杰出的芭蕾舞女演员安娜·帕夫洛娃共舞。

source: Mr Shankar joined his brother's touring dance troupe at the age of ten, but by his late teens he had set his heart on the sitar, a guitar-like instrument with a gourd-shaped body and both melodic and "sympathetic" strings (the latter resonate when the former are plucked).
zh_cn: 10岁时，香卡先生加入了大哥的舞蹈团巡演，但到了十七八岁的时候，他决定专注于西塔琴，一种类似吉他的乐器，身形像葫芦，由主弦和共鸣弦组成（当拨动前者时，后者就会共鸣回响。）

source: Mr Shankar gained acclaim in India as both a performer and a composer--he wrote scores for Satyajit Ray, a fellow Bengali who is still regarded as one of the country's best film-makers.
zh_cn: 作为演奏家和作曲家，香卡在印度赢得了赞誉。他曾为萨蒂亚吉特·雷伊的电影配乐。雷伊也是孟加拉人，现在仍被视为全印度最优秀的电影导演之一。

source: He started teaching American jazz musicians such as John Coltrane and Don Ellis, and also recorded albums with Yehudi Menuhin, an American violinist, and Philip Glass, one of the 20th century's most influential composers.
zh_cn: 他开始教美国爵士乐音乐家，如约翰·克特兰和唐·埃利斯，亦同美国著名小提琴家耶胡迪·梅纽因，以及20世纪最有影响力的作曲家之一菲利普·格拉斯一同录制唱片。

source: But he is perhaps best known for his influence on the Beatles--Harrison, the band's lead guitarist, was so taken with Mr Shankar that he went to India to have sitar lessons with him.
zh_cn: 但他最为人所知的也许是他对哈里森 （披头士乐队的主音吉他手）产生的影响。哈里森对香卡无比倾心，专程去印度向他学习西塔琴。

source: Music was also the spine of his personal life.
zh_cn: 音乐也贯穿在他的私人生活中。

source: His first wife was Annapurna Devi, his guru's daughter and a gifted sitarist. A 2005 biography of Ms Devi states that her husband made her vow not to perform in public so that she would not overshadow him.
zh_cn: 他的第一任妻子是安娜普纳·德维，他的古鲁（guru）的女儿，也是一位有才华的西塔琴演奏家。在2005年出版的德维女士传记中，她提到，香卡要求她发誓不公开表演，以免使他黯然失色。

source: In the late 1940s, Mr Shankar began a long relationship with Kamala Shastri, a dancer.
zh_cn: 在20世纪40年代末，香卡与舞蹈家卡马拉·夏斯特里开始了一段长期的恋情。

source: He then met Sue Jones, a concert producer with whom he had a daughter in 1979, Norah Jones, a singer who has won nine Grammy awards.
zh_cn: 后来他遇到了演唱会制作人苏·琼斯，两人在1979年育有一个女儿，诺拉·琼斯。诺拉·琼斯后来赢得了9座格莱美奖的歌手。

source: In 1989, he married Sukanya Rajan.
zh_cn: 在1989年，他娶了苏卡妮· 阿·拉扬。

source: Their daughter, Anoushka Shankar, is a sitarist who performed regularly with her father over the last decade.
zh_cn: 他们的女儿，安努什卡·香卡，也是一位西塔琴演奏家，在过去10年经常与父亲同台演出。

source: On paper, Mr Shankar was a perfect guru for the long-haired, incense-burning hippy movement.
zh_cn: 表面上看，香卡对留着长发、爱焚香的嬉皮士们来说是一位完美的上师。

source: But, in later years, he admitted he was not entirely comfortable at the hedonistic California festivals of the 1960s, such as Monterey Festival and Woodstock.
zh_cn: 不过后来他承认，他对在20世纪60年代在加州举行的的各种音乐节，如蒙特利音乐节和伍德斯托克音乐节，并非毫无保留。

source: The drugs, mayhem and short-lived fads for one kind of music or another unsettled him.
zh_cn: 其间充斥的吸毒、斗殴和各种昙花一现的音乐潮流，使他很不安。

source: He thought Jimi Hendrix's flaming guitar was the "greatest sacrilege possible".
zh_cn: 他认为吉米·汉德克斯燃烧吉他的行为，是“最大的渎神行为”。

source: However, he continued his pop music collaborations, even though some musicians in India, perhaps envious, criticised him for working with Western popstars.
zh_cn: 尽管如此，他继续着他与流行音乐的合作，即使在印度有一些音乐家（或许是出于嫉妒）批评他与西方流行歌手合作的行为。

source: A week before his death, he was told that he would receive a lifetime achievement award at next year's Grammy ceremony in February.
zh_cn: 去世前一周，他刚被告知，他将在明年2月的格莱美颁奖典礼上接受终身成就奖。
